OpenFOAM-v2506/modules/visualization/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/system/README
fvSolution is used for outer correctors specification.
fvSchemes is only so that pre-processing activities can proceed

